Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/legal_representation_in_criminal_cases.html.txt.tmx
Source language: en
Languages: ga

source: Legal representation in criminal cases
ga: Ionadaíocht Dhleathach i gcás Coiriúil

source: There are two types of criminal offence; a summary offence, which can be tried by a District Court judge sitting without a jury, and an indictable offence, which is tried by a Circuit or High Court judge sitting with a jury
ga: Tá dhá chineál cás coiriúil ann; coir achoimre gur féidir le Breitheamh sa Chúirt Dúiche a éisteacht leis féin gan aon ghiúiré a bheith i láthair, agus coir inchúisithe a éistear sa Chúirt Chuarda nó san Ard Chúirt ós comhair breitheamh agus giúire

source: If you have been charged with a summary offence, you may be represented by a solicitor and/or a barrister
ga: Má chuirtear coir achoimre i do leith is féidir le aturnae agus/nó abhcóide ionadaíocht a dhéanamh ar do shon

source: Criminal legal aid is not generally available at the District Court
ga: De ghnáth níl Cúnamh Dlí Choiriúil le fáil sa Chúirt Dúiche

source: If you have been charged with an indictable offence, you will normally be represented by a solicitor and a barrister (counsel)
ga: Má tá coir inchúisithe curtha i do leith, déanfaidh aturnae agus abhcóide (consailéir) ionadaíocht ar do shon

source: Usually, you will be represented by a solicitor, a junior counsel and a senior counsel
ga: De ghnáth beidh aturnae, abhcóide sóisir , agus abhcóide sinsir i láthair ar do shon

source: If you qualify for criminal legal aid, the state will cover the cost of your lawyers
ga: Íocfaidh an Stáit costaisí do chuid dlíodóirí má tá tú i dteideal Cúnamh Dlí Choiriúil

source: If you are the accused in a criminal trial, your defence counsel must behave according to the following rules
ga: Más tusa an té go bhfuil an choir curtha ina leith i gcás choiriúil, beidh ar do chonsailéir cosanta cloí leis na rialacha seo leanas

source: Duties of the Defence Counsel
ga: Dualgaisí an Chonsailéir Chosanta

source: The main duty of the defence counsel is to defend you whether or not they think or believe you are guilty
ga: An príomh dhualgas atá ar an gconsailéir cosanta ná tusa a chosaint is cuma an gceapann sé/sí an bhfuil tú ciontach nó nach bhfuil

source: The defence counsel must always give a criminal case priority over all other matters
ga: Tá ar an gConsailéir Cosanta tús áite a thabhairt do chás choiriúil

source: The defence counsel is under a duty to stay with you even if you are not accepting their advice
ga: Tá ar an gConsailéir Cosanta fanacht leat fiú muna bhfuil tú ag glacadh lena chomhairle

source: The defence counsel cannot withdraw from your case because of any conduct or remarks made by the trial judge
ga: Níl cead ag an gConsailéir Cósanta do chás a thabhairt suas toisc go ndéanann nó go ndeireann an breitheamh atá ag triail an cháis rud éigin

source: The defence counsel should be present throughout the trial at all times
ga: Ba chóir don Chonsailéir Cosanta a bheith i láthair i rith an triail ina iomláine

source: However, if, due to unforeseen circumstances, they have to leave, they must see that you are not at any stage unrepresented and they must obtain the consent of your solicitor to be absent
ga: Más gá dó/di a bheith as láthair, áfach, caithfidh sé/sí déanamh cinnte de nach bhfuil tú fágtha gan ionadaíocht ag aon am agus caithfidh sé/sí cead imeachta a fháil ó do aturnae

source: Where there are two defence counsel, neither may leave the trial except temporarily and for good reason
ga: Sa chás go bhfuil beirt chonsailéir i láthair níl cead ag ceachtar acu bheith imithe ach ar bhun sealadach agus caithfidh cúis mhaith a bheith acu a bheith as láthair

source: The defence counsel must be properly briefed - that is, they must have received all of the relevant information relating to your case at least one week prior to the trial date
ga: Ní mór don chonsailéir cosanta miontheagaisc iomlán do chása a bheith acu, ar a laghad, seachtain sula dtosnaíonn do chás sa chúirt

source: The defence counsel also owes a duty to the court
ga: Tá dualgas, freisin, ar an gconsailéir don chúirt

source: they must not knowingly state a lie in court
ga: Níl cead aige/aici bréag a lua sa chúirt, má thuigeann sé/ sí gur bréag é

source: If you tell your barrister that you are guilty before the start of the trial, they can continue to act for you if you plead guilty
ga: Ag tús na trialach má deireann tú le do abhcóide go bhfuil tú "Ciontach", fós, is féidir leis/lei ionadaíocht a dhéanamh ort

source: If you plead not guilty, they are very restricted as to the type of defence they can mount on your behalf
ga: Má deireann tú go bhfuil tú "Neamh Chiontach" tá sé/sí cosctha ina a lán bealaí maidir leis an gcás cosanta gur féidir leis/lei a dhéanamh ar do shon

source: If you flee, your legal representation may withdraw from the case
ga: Má theitheann tú, is féidir le do ionadaíocht dlí éirí as an gcás

source: The decision whether or not to give evidence is your decision and not your counsel's
ga: Is tú féin a dhéanann an cinneadh maidir le fianaise a thabhairt nó gan é a thabhairt agus ní dhéanann do chonsailéir an cinneadh seo duit

source: If you are convicted, the defence counsel has a duty to see you and to appear for you in any appeal unless they has advised against the appeal
ga: Má fhaightear ciontach tú, tá ar do chonsailéir cosanta seasamh leat agus ionadaíocht a dhéanamh ort má bhíonn athchomharc i gceist munar chuir sé/sí comhairle ort gan achomharc a éileamh
